app/views/comments/_comment.html.erb

<h2 class="card-header">comments</h2>
  <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 7]]