app/controllers/comments_controller.rb

    def create
        # @post = Post.find(params[:post_id])
        # @comment = @post.comments.create(comment_params.merge(user_id: current_user.id))
        @comment = Comment.create(comment_params.merge(user_id: current_user.id))
---
INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "cobaa"], ["post_id", 3], ["user_id", 1], ["created_at", "2022-09-20 11:33:57.445624"], ["updated_at", "2022-09-20 11:33:57.445624"]]

    def destroy
    if @user == true
        @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 6]]