app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC
---
  def index
    @posts = Post.order(:id)

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["content", "12345"], ["created_at", "2022-09-20 09:23:58.153255"], ["updated_at", "2022-09-20 09:23:58.153255"], ["user_id", 1]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "erwefgaerg tambah"], ["updated_at", "2022-09-21 04:12:37.975568"], ["id", 2]]
---
  def update
    if @user == true
      respond_to do |format|
        if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 4]]
---
  def destroy
    if @user == true
      @post.destroy